## 10 min to pandas
(http://pandas.pydata.org/pandas-docs/stable/10min.html)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### 创建Series

In [4]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

s

### 创建DataFrame

#### 通过numpy数组创建DataFrame，加入时间索引及列标签

In [7]:
dates = pd.date_range('20130101', periods=6)

In [8]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.rand(6, 4), index=dates, columns=list('ABCD'))

In [10]:
df

                   A         B         C         D
2013-01-01  0.614964  0.618974  0.266078  0.361227
2013-01-02  0.335037  0.867161  0.682835  0.380753
2013-01-03  0.715007  0.040391  0.219950  0.575061
2013-01-04  0.759715  0.894425  0.497867  0.412312
2013-01-05  0.471062  0.678183  0.600388  0.454598
2013-01-06  0.096909  0.349745  0.080660  0.302073

#### 通过字典创建DataFrame

In [11]:
df2 = pd.DataFrame({'A':1.,
                    'B':pd.Timestamp('20130102'),
                    'C':pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D':np.array([3] * 4, dtype='int32'),
                    'E':pd.Categorical(['test','train', 'test', 'train']),
                    'F':'foo'})

In [12]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [13]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### 查看数据

#### 查看最上面和最下面几行

In [14]:
df.head()

                   A         B         C         D
2013-01-01  0.614964  0.618974  0.266078  0.361227
2013-01-02  0.335037  0.867161  0.682835  0.380753
2013-01-03  0.715007  0.040391  0.219950  0.575061
2013-01-04  0.759715  0.894425  0.497867  0.412312
2013-01-05  0.471062  0.678183  0.600388  0.454598

In [15]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.759715  0.894425  0.497867  0.412312
2013-01-05  0.471062  0.678183  0.600388  0.454598
2013-01-06  0.096909  0.349745  0.080660  0.302073

#### 查看索引、列名以及numpy数据

In [19]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [21]:
df.values

array([[ 0.61496372,  0.61897365,  0.26607772,  0.36122723],
       [ 0.33503726,  0.86716145,  0.68283455,  0.38075291],
       [ 0.71500661,  0.04039121,  0.21994952,  0.57506085],
       [ 0.75971491,  0.89442499,  0.49786712,  0.41231161],
       [ 0.4710621 ,  0.67818344,  0.60038845,  0.45459758],
       [ 0.09690867,  0.34974491,  0.08066048,  0.30207277]])

### 数据基本统计

In [36]:

df.describe()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>A</th>
      <th>B</th>
      <th>C</th>
      <th>D</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>count</th>
      <td>6.000000</td>
      <td>6.000000</td>
      <td>6.000000</td>
      <td>6.000000</td>
    </tr>
    <tr>
      <th>mean</th>
      <td>0.441667</td>
      <td>0.349858</td>
      <td>0.451300</td>
      <td>0.315104</td>
    </tr>
    <tr>
      <th>std</th>
      <td>0.199756</td>
      <td>0.320932</td>
      <td>0.396777</td>
      <td>0.327077</td>
    </tr>
    <tr>
      <th>min</th>
      <td>0.294230</td>
      <td>0.069574</td>
      <td>0.011470</td>
      <td>0.027427</td>
    </tr>
    <tr>
      <th>25%</th>
      <td>0.337093</td>
      <td>0.123174</td>
      <td>0.127707</td>
      <td>0.095510</td>
    </tr>
    <tr>
      <th>50%</th>
      <td>0.367931</td>
      <td>0.226934</td>
      <td>0.432734</td>
      <td>0.238948</td>
    </tr>
    <tr>
      <th>75%</th>
      <td>0.436271</td>
      <td>0.508299</td>
      <td>0.734429</td>
      <td>0.373603</td>
    </tr>
    <tr>
      <th>max</th>
      <td>0.834044</td>
      <td>0.885030</td>
      <td>0.969837</td>
      <td>0.919116</td>
    </tr>
  </tbody>
</table>
</div>

### 数据转置

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.614964    0.335037    0.715007    0.759715    0.471062    0.096909
B    0.618974    0.867161    0.040391    0.894425    0.678183    0.349745
C    0.266078    0.682835    0.219950    0.497867    0.600388    0.080660
D    0.361227    0.380753    0.575061    0.412312    0.454598    0.302073

### 排序

In [23]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.361227  0.266078  0.618974  0.614964
2013-01-02  0.380753  0.682835  0.867161  0.335037
2013-01-03  0.575061  0.219950  0.040391  0.715007
2013-01-04  0.412312  0.497867  0.894425  0.759715
2013-01-05  0.454598  0.600388  0.678183  0.471062
2013-01-06  0.302073  0.080660  0.349745  0.096909

#### 按某列数值排序

In [24]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03  0.715007  0.040391  0.219950  0.575061
2013-01-06  0.096909  0.349745  0.080660  0.302073
2013-01-01  0.614964  0.618974  0.266078  0.361227
2013-01-05  0.471062  0.678183  0.600388  0.454598
2013-01-02  0.335037  0.867161  0.682835  0.380753
2013-01-04  0.759715  0.894425  0.497867  0.412312

### 数据筛选

#### 选取某一列

In [25]:
df['A']

2013-01-01    0.614964
2013-01-02    0.335037
2013-01-03    0.715007
2013-01-04    0.759715
2013-01-05    0.471062
2013-01-06    0.096909
Freq: D, Name: A, dtype: float64

In [26]:
df.A

2013-01-01    0.614964
2013-01-02    0.335037
2013-01-03    0.715007
2013-01-04    0.759715
2013-01-05    0.471062
2013-01-06    0.096909
Freq: D, Name: A, dtype: float64

#### 选择多行

In [27]:
df[0:3]

                   A         B         C         D
2013-01-01  0.614964  0.618974  0.266078  0.361227
2013-01-02  0.335037  0.867161  0.682835  0.380753
2013-01-03  0.715007  0.040391  0.219950  0.575061

In [28]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.335037  0.867161  0.682835  0.380753
2013-01-03  0.715007  0.040391  0.219950  0.575061
2013-01-04  0.759715  0.894425  0.497867  0.412312

#### 通过标签选取

In [30]:
df.loc[dates[0]]

A    0.614964
B    0.618974
C    0.266078
D    0.361227
Name: 2013-01-01 00:00:00, dtype: float64

In [31]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.614964  0.618974
2013-01-02  0.335037  0.867161
2013-01-03  0.715007  0.040391
2013-01-04  0.759715  0.894425
2013-01-05  0.471062  0.678183
2013-01-06  0.096909  0.349745

In [32]:
df.loc['20130102':'20130104',['A', 'B']]

                   A         B
2013-01-02  0.335037  0.867161
2013-01-03  0.715007  0.040391
2013-01-04  0.759715  0.894425

In [34]:
df.loc[dates[0], 'A']

0.61496372094276064

In [35]:
df.at[dates[0], 'A']

0.61496372094276064

#### 通过位置选取

In [36]:
df.iloc[3]

A    0.759715
B    0.894425
C    0.497867
D    0.412312
Name: 2013-01-04 00:00:00, dtype: float64

In [37]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.759715  0.894425
2013-01-05  0.471062  0.678183

In [38]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  0.335037  0.682835
2013-01-03  0.715007  0.219950
2013-01-05  0.471062  0.600388

In [39]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.335037  0.867161  0.682835  0.380753
2013-01-03  0.715007  0.040391  0.219950  0.575061

In [40]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.618974  0.266078
2013-01-02  0.867161  0.682835
2013-01-03  0.040391  0.219950
2013-01-04  0.894425  0.497867
2013-01-05  0.678183  0.600388
2013-01-06  0.349745  0.080660

In [41]:
df.iloc[1,1]

0.86716145161597447

In [42]:
df.iat[1,1]

0.86716145161597447

#### 条件筛选

In [45]:
df[df.A > 0.5]

                   A         B         C         D
2013-01-01  0.614964  0.618974  0.266078  0.361227
2013-01-03  0.715007  0.040391  0.219950  0.575061
2013-01-04  0.759715  0.894425  0.497867  0.412312

In [46]:
df[df > 0.5]

                   A         B         C         D
2013-01-01  0.614964  0.618974       NaN       NaN
2013-01-02       NaN  0.867161  0.682835       NaN
2013-01-03  0.715007       NaN       NaN  0.575061
2013-01-04  0.759715  0.894425       NaN       NaN
2013-01-05       NaN  0.678183  0.600388       NaN
2013-01-06       NaN       NaN       NaN       NaN

### 添加新的一列

In [52]:
df2 = df.copy()

In [53]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [54]:
df2

                   A         B         C         D      E
2013-01-01  0.614964  0.618974  0.266078  0.361227    one
2013-01-02  0.335037  0.867161  0.682835  0.380753    one
2013-01-03  0.715007  0.040391  0.219950  0.575061    two
2013-01-04  0.759715  0.894425  0.497867  0.412312  three
2013-01-05  0.471062  0.678183  0.600388  0.454598   four
2013-01-06  0.096909  0.349745  0.080660  0.302073  three

In [63]:
df2[df2['E'].isin(['two', 'four'])]

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>A</th>
      <th>B</th>
      <th>C</th>
      <th>D</th>
      <th>E</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>2013-01-03</th>
      <td>0.375726</td>
      <td>0.568999</td>
      <td>0.440269</td>
      <td>0.919116</td>
      <td>two</td>
    </tr>
    <tr>
      <th>2013-01-05</th>
      <td>0.456453</td>
      <td>0.326197</td>
      <td>0.832482</td>
      <td>0.307782</td>
      <td>four</td>
    </tr>
  </tbody>
</table>
</div>

### 赋值

#### 通过索引设置一个新列

In [57]:
sl = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [58]:
sl

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

#### 通过标签设置数值

In [59]:
df.at[dates[0], 'A'] = 0

#### 通过位置设置数值

In [60]:
df.iat[0,1] = 0

#### 通过numpy数组设置值

In [61]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [62]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.266078  5
2013-01-02  0.335037  0.867161  0.682835  5
2013-01-03  0.715007  0.040391  0.219950  5
2013-01-04  0.759715  0.894425  0.497867  5
2013-01-05  0.471062  0.678183  0.600388  5
2013-01-06  0.096909  0.349745  0.080660  5

#### where操作设置

In [63]:
df2 = df.copy()

In [64]:
df2[df2 > 0] = -df2

In [65]:
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.266078 -5
2013-01-02 -0.335037 -0.867161 -0.682835 -5
2013-01-03 -0.715007 -0.040391 -0.219950 -5
2013-01-04 -0.759715 -0.894425 -0.497867 -5
2013-01-05 -0.471062 -0.678183 -0.600388 -5
2013-01-06 -0.096909 -0.349745 -0.080660 -5

### 缺失数据处理

pandas使用np.nan来代替缺失值，默认不参与运算
重新索引可改变/添加/删除 特定行的索引。返回的是数据的copy

In [67]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [68]:
df1

                   A         B         C  D   E
2013-01-01  0.000000  0.000000  0.266078  5 NaN
2013-01-02  0.335037  0.867161  0.682835  5 NaN
2013-01-03  0.715007  0.040391  0.219950  5 NaN
2013-01-04  0.759715  0.894425  0.497867  5 NaN

#### 对缺失数据赋值

In [69]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [70]:
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.266078  5  1.0
2013-01-02  0.335037  0.867161  0.682835  5  1.0
2013-01-03  0.715007  0.040391  0.219950  5  NaN
2013-01-04  0.759715  0.894425  0.497867  5  NaN

#### 删除有缺失值的行

In [71]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.266078  5  1.0
2013-01-02  0.335037  0.867161  0.682835  5  1.0

#### 填充缺失值

In [72]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.266078  5  1.0
2013-01-02  0.335037  0.867161  0.682835  5  1.0
2013-01-03  0.715007  0.040391  0.219950  5  5.0
2013-01-04  0.759715  0.894425  0.497867  5  5.0

#### 判断是否为缺失值

In [73]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

### 数据统计

In [74]:
df.mean()

A    0.396288
B    0.471651
C    0.391296
D    5.000000
dtype: float64

#### 按行统计

In [75]:
df.mean(1)

2013-01-01    1.316519
2013-01-02    1.721258
2013-01-03    1.493837
2013-01-04    1.788002
2013-01-05    1.687408
2013-01-06    1.381829
Freq: D, dtype: float64

#### Apply

In [76]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000  0.266078   5
2013-01-02  0.335037  0.867161  0.948912  10
2013-01-03  1.050044  0.907553  1.168862  15
2013-01-04  1.809759  1.801978  1.666729  20
2013-01-05  2.280821  2.480161  2.267117  25
2013-01-06  2.377730  2.829906  2.347778  30

In [77]:
df.apply(lambda x: x.max() - x.min())

A    0.759715
B    0.894425
C    0.602174
D    0.000000
dtype: float64

### 字符串操作

In [78]:
s = pd.Series(['A', 'Aaba', np.nan, 'ACB'])

In [79]:
s.str.lower()

0       a
1    aaba
2     NaN
3     acb
dtype: object

### Merge（连接操作）

#### Concat

In [80]:
df = pd.DataFrame(np.random.rand(10, 4))

In [81]:
df

          0         1         2         3
0  0.954261  0.570125  0.175218  0.723860
1  0.936268  0.701236  0.437792  0.543272
2  0.802972  0.633746  0.472176  0.592832
3  0.327799  0.229082  0.078346  0.152799
4  0.622721  0.269256  0.234983  0.073391
5  0.457793  0.529518  0.504692  0.362500
6  0.646064  0.014877  0.613308  0.422234
7  0.155063  0.017678  0.253728  0.685436
8  0.192181  0.029348  0.943900  0.699069
9  0.023536  0.265642  0.831999  0.506516

In [82]:
pieces = [df[:3], df[3:7], df[7:]]

In [83]:
pd.concat(pieces)

          0         1         2         3
0  0.954261  0.570125  0.175218  0.723860
1  0.936268  0.701236  0.437792  0.543272
2  0.802972  0.633746  0.472176  0.592832
3  0.327799  0.229082  0.078346  0.152799
4  0.622721  0.269256  0.234983  0.073391
5  0.457793  0.529518  0.504692  0.362500
6  0.646064  0.014877  0.613308  0.422234
7  0.155063  0.017678  0.253728  0.685436
8  0.192181  0.029348  0.943900  0.699069
9  0.023536  0.265642  0.831999  0.506516

#### join

In [84]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [85]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [86]:
left

   key  lval
0  foo     1
1  foo     2

In [87]:
right

   key  rval
0  foo     4
1  foo     5

In [88]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [89]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

In [90]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [91]:
left

   key  lval
0  foo     1
1  bar     2

In [92]:
right

   key  rval
0  foo     4
1  bar     5

In [93]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

#### Append

In [94]:
df = pd.DataFrame(np.random.rand(8, 4), columns=['A', 'B', 'C', 'D'])

In [95]:
df

          A         B         C         D
0  0.887966  0.899050  0.678108  0.290294
1  0.337710  0.681950  0.506052  0.834648
2  0.897392  0.615358  0.682939  0.066616
3  0.595811  0.862979  0.729884  0.428949
4  0.485513  0.967854  0.798325  0.565377
5  0.437332  0.793984  0.825442  0.803532
6  0.757801  0.832720  0.448492  0.706450
7  0.317707  0.764355  0.943663  0.498086

In [96]:
s = df.iloc[3]

In [97]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.887966  0.899050  0.678108  0.290294
1  0.337710  0.681950  0.506052  0.834648
2  0.897392  0.615358  0.682939  0.066616
3  0.595811  0.862979  0.729884  0.428949
4  0.485513  0.967854  0.798325  0.565377
5  0.437332  0.793984  0.825442  0.803532
6  0.757801  0.832720  0.448492  0.706450
7  0.317707  0.764355  0.943663  0.498086
8  0.595811  0.862979  0.729884  0.428949

### Grouping（分组）

In [98]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})

In [100]:
df.groupby('A').sum()

            C         D
A
bar  3.140878  1.076359
foo  1.067369 -0.977103

In [101]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    1.272286  0.757719
    three  1.244988  0.099686
    two    0.623604  0.218954
foo one    0.117378 -3.256021
    three -0.110350  1.100882
    two    1.060341  1.178036

### Reshaping

#### Stack

In [102]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                      'foo', 'foo', 'qux', 'qux'],
                     ['one', 'two', 'one', 'two',
                      'one', 'two', 'one', 'two']]))

In [103]:
index = pd.MultiIndex.from_tuples(tuples, names=['frist', 'second'])

In [104]:
df = pd.DataFrame(np.random.rand(8, 2), index=index, columns=['A', 'B'])

In [105]:
df2 = df[:4]

In [106]:
df2

                     A         B
frist second
bar   one     0.525585  0.294377
      two     0.568321  0.048617
baz   one     0.482960  0.604917
      two     0.610582  0.099443

In [107]:
stacked = df2.stack()

In [108]:
stacked

frist  second
bar    one     A    0.525585
               B    0.294377
       two     A    0.568321
               B    0.048617
baz    one     A    0.482960
               B    0.604917
       two     A    0.610582
               B    0.099443
dtype: float64

In [109]:
stacked.unstack()

                     A         B
frist second
bar   one     0.525585  0.294377
      two     0.568321  0.048617
baz   one     0.482960  0.604917
      two     0.610582  0.099443

In [110]:
stacked.unstack(1)

second        one       two
frist
bar   A  0.525585  0.568321
      B  0.294377  0.048617
baz   A  0.482960  0.610582
      B  0.604917  0.099443

In [111]:
stacked.unstack(0)

frist          bar       baz
second
one    A  0.525585  0.482960
       B  0.294377  0.604917
two    A  0.568321  0.610582
       B  0.048617  0.099443


### 时间序列

In [112]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [113]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [114]:
ts.resample('5Min').sum()

2012-01-01    22751
Freq: 5T, dtype: int32

In [115]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [116]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [117]:
ts

2012-03-06    0.159277
2012-03-07   -0.919048
2012-03-08   -0.450287
2012-03-09    0.633219
2012-03-10    0.516496
Freq: D, dtype: float64

In [118]:
ts_utc = ts.tz_localize('UTC')

In [119]:
ts_utc

2012-03-06 00:00:00+00:00    0.159277
2012-03-07 00:00:00+00:00   -0.919048
2012-03-08 00:00:00+00:00   -0.450287
2012-03-09 00:00:00+00:00    0.633219
2012-03-10 00:00:00+00:00    0.516496
Freq: D, dtype: float64

In [120]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    0.159277
2012-03-06 19:00:00-05:00   -0.919048
2012-03-07 19:00:00-05:00   -0.450287
2012-03-08 19:00:00-05:00    0.633219
2012-03-09 19:00:00-05:00    0.516496
Freq: D, dtype: float64